package Summary5;
/*
Туристическое агентство имеет очередь ожидания для обработки заявок на бронирование туров.
Когда клиенты подают заявку, их заявки добавляются в конец очереди. Когда тур становится доступным,
первая заявка в очереди обрабатывается, и клиент получает подтверждение о бронировании.

Требования:

    Очередь должна поддерживать добавление заявок в конец очереди и удаление заявок из начала очереди.
    Если в очереди нет заявок, метод удаления из очереди должен возвращать null.
    Очередь должна быть ограничена по размеру, чтобы ограничить количество заявок,
    которые могут находиться в очереди одновременно.
    Очередь должна быть реализована с использованием коллекции Queue из библиотеки Java.

 */
public class TourBuro {
}
